#+title: Emacs Lisp


#+begin_src emacs-lisp
(load-file "~/repos/cora/src/cora.el") ; load Cora library
#+end_src

* Lesson Eleven

Structs

#+begin_src emacs-lisp
(require 'cl-lib)

(cl-defstruct person
  age
  male?
  height
  weight)

(setq bob (make-person
            :age 30
            :male? t
            :height 58
            :weight 205))

(person-weight bob)
#+end_src

#+RESULTS:
: 205



